#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ВКМ_УчетИспОтпусков
	Движения.ВКМ_УчетИспОтпусков.Записывать = Истина;
	Для Каждого ТекСтрокаОтпускаСотрудников из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_УчетИспОтпусков.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаОтпускаСотрудников.Сотрудник;
		Движение.ФактОтпуска = ТекСтрокаОтпускаСотрудников.ПродолжительностьОтпуска;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли